---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideTransparency(System.Double@)
source: html/bded077c-4190-fddb-ec44-558a55baec01.htm
---
# Autodesk.Revit.DB.DirectContext3D.DrawContext.GetOverrideTransparency Method

Returns override transparency that will be applied to geometry during rendering.

## Syntax (C#)
```csharp
public static bool GetOverrideTransparency(
	out double transparency
)
```

## Parameters
- **transparency** (`System.Double %`)